---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.EquipmentBehavior
source: html/64b93255-1f76-bb96-aa7a-9e55c16cf75a.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.EquipmentBehavior Property

The behavior of how zone equipment is allocated with assigned spaces.

## Syntax (C#)
```csharp
public ZoneEquipmentBehavior EquipmentBehavior { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration